Revit 2027 API
BuiltInFailures.TrussFailures.TrussLayoutNonSympleTopChord Property
 This truss layout family defines an offset or non horizontal top chord. This may conflict with attachment or profile editing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussLayoutNonSympleTopChord { get; }
Public Shared ReadOnly Property TrussLayoutNonSympleTopChord As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussLayoutNonSympleTopChord {
	FailureDefinitionId^ get ();
}
static member TrussLayoutNonSympleTopChord : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace